In [1]:
import pandas as pd

In [2]:
# read json and convert to df
train_json = pd.read_json('../data/bird-sql/train/train.json')
train_df = pd.DataFrame(train_json)

dev_json = pd.read_json('../data/bird-sql/dev/dev.json')
dev_df = pd.DataFrame(dev_json)

In [3]:
train_df.head(20)

,db_id,question,evidence,SQL
0,movie_platform,Name movie titles released in year 1945. Sort ...,released in the year 1945 refers to movie_rele...,SELECT movie_title FROM movies WHERE movie_rel...
1,movie_platform,State the most popular movie? When was it rele...,most popular movie refers to MAX(movie_popular...,"SELECT movie_title, movie_release_year, direct..."
2,movie_platform,What is the name of the longest movie title? W...,longest movie title refers to MAX(LENGTH(movie...,"SELECT movie_title, movie_release_year FROM mo..."
3,movie_platform,Name the movie with the most ratings.,movie with the most rating refers to MAX(SUM(r...,SELECT movie_title FROM movies GROUP BY movie_...
4,movie_platform,What is the average number of Mubi users who l...,average = AVG(movie_popularity); number of Mub...,SELECT AVG(movie_popularity) FROM movies WHERE...
5,movie_platform,What is the average rating for movie titled 'W...,average rating = DIVIDE((SUM(rating_score wher...,SELECT AVG(T2.rating_score) FROM movies AS T1 ...
6,movie_platform,What is the user avatar url for user 41579158?...,user avatar url refers to user_avatar_image_ur...,"SELECT T3.user_avatar_image_url, T3.rating_dat..."
7,movie_platform,What is the percentage of the ratings were rat...,user is a subscriber refers to user_subscriber...,SELECT CAST(SUM(CASE WHEN user_subscriber = 1 ...
8,movie_platform,List all movie title rated in April 2020 from ...,movie title rated in April 2020 refers to rati...,SELECT T1.movie_title FROM movies AS T1 INNER ...
9,movie_platform,List ther users who gave the worst rating for ...,worst rating refers to rating_score = 1;,SELECT T1.user_id FROM ratings AS T1 INNER JOI...
10,movie_platform,List all movies with the best rating score. St...,best rating score refers to rating_score = 5; ...,"SELECT DISTINCT T2.movie_title, T2.movie_popul..."
11,movie_platform,"For all ratings which are rated in year 2020, ...",ratings in year 2020 refers to rating_timestam...,SELECT T2.movie_title FROM ratings AS T1 INNER...
12,movie_platform,"For all movies where users left a critic, find...",movies where users left a critic refers to cri...,"SELECT T2.movie_title, T1.user_id, T1.rating_s..."
13,movie_platform,"For movie titled 'Welcome to the Dollhouse', h...",rated with highest score refers to rating_scor...,SELECT CAST(SUM(CASE WHEN T2.rating_score = 5 ...
14,movie_platform,What is the percentage of rated movies were re...,percentage = DIVIDE(SUM(movie_release_year = 2...,SELECT CAST(SUM(CASE WHEN T1.movie_release_yea...
15,movie_platform,"Who is the director of the movie Sex, Drink an...","Sex, Drink and Bloodshed refers to movie title...",SELECT director_name FROM movies WHERE movie_t...
16,movie_platform,What is the name of the most followed list?,most followed list refers to MAX(list_followers);,SELECT list_title FROM lists ORDER BY list_fol...
17,movie_platform,What are the URL to the list page on Mubi of t...,URL to the list page on Mubi refers to list_ur...,SELECT list_url FROM lists WHERE list_update_t...
18,movie_platform,What is the list ID that was first created by ...,first created list refers to oldest list_creat...,SELECT list_id FROM lists_users WHERE user_id ...
19,movie_platform,"For movie id 1269, how many users, who was a p...",paying subscriber refers to user_has_payment_m...,SELECT COUNT(*) FROM ratings WHERE movie_id = ...

In [4]:
dev_df.head(20)

,question_id,db_id,question,evidence,SQL,difficulty
0,0,california_schools,What is the highest eligible free rate for K-1...,Eligible free rate for K-12 = `Free Meal Count...,SELECT `Free Meal Count (K-12)` / `Enrollment ...,simple
1,1,california_schools,Please list the lowest three eligible free rat...,Eligible free rates for students aged 5-17 = `...,SELECT `Free Meal Count (Ages 5-17)` / `Enroll...,moderate
2,2,california_schools,Please list the zip code of all the charter sc...,Charter schools refers to `Charter School (Y/N...,SELECT T2.Zip FROM frpm AS T1 INNER JOIN schoo...,simple
3,3,california_schools,What is the unabbreviated mailing address of t...,,SELECT T2.MailStreet FROM frpm AS T1 INNER JOI...,simple
4,4,california_schools,Please list the phone numbers of the direct ch...,Charter schools refers to `Charter School (Y/N...,SELECT T2.Phone FROM frpm AS T1 INNER JOIN sch...,moderate
5,5,california_schools,How many schools with an average score in Math...,Exclusively virtual refers to Virtual = 'F',SELECT COUNT(DISTINCT T2.School) FROM satscore...,simple
6,6,california_schools,Among the schools with the SAT test takers of ...,Magnet schools or offer a magnet program means...,SELECT T2.School FROM satscores AS T1 INNER JO...,simple
7,7,california_schools,What is the phone number of the school that ha...,,SELECT T2.Phone FROM satscores AS T1 INNER JOI...,simple
8,8,california_schools,What is the number of SAT test takers of the s...,,SELECT NumTstTakr FROM satscores WHERE cds = (...,simple
9,9,california_schools,Among the schools with the average score in Ma...,,SELECT COUNT(T2.`School Code`) FROM satscores ...,simple
10,10,california_schools,For the school with the highest average score ...,,SELECT T2.`FRPM Count (Ages 5-17)` FROM satsco...,simple
11,11,california_schools,Please list the codes of the schools with a to...,Total enrollment can be represented by `Enroll...,SELECT T2.CDSCode FROM schools AS T1 INNER JOI...,simple
12,12,california_schools,Among the schools with an SAT excellence rate ...,Excellence rate = NumGE1500 / NumTstTakr; Elig...,SELECT MAX(CAST(T1.`Free Meal Count (Ages 5-17...,moderate
13,13,california_schools,Please list the phone numbers of the schools w...,Excellence rate = NumGE1500 / NumTstTakr,SELECT T1.Phone FROM schools AS T1 INNER JOIN ...,simple
14,14,california_schools,"List the top five schools, by descending order...",,SELECT T1.NCESSchool FROM schools AS T1 INNER ...,simple
15,15,california_schools,Which active district has the highest average ...,,SELECT T1.District FROM schools AS T1 INNER JO...,simple
16,16,california_schools,How many schools in merged Alameda have number...,,SELECT COUNT(T1.CDSCode) FROM schools AS T1 IN...,simple
17,17,california_schools,What is the charter number of the school that ...,,SELECT T1.CharterNum FROM schools AS T1 INNER ...,simple
18,18,california_schools,How many schools in Contra Costa (directly fun...,,SELECT COUNT(T1.CDSCode) FROM frpm AS T1 INNER...,simple
19,19,california_schools,What is the phone number of the school that ha...,,SELECT T1.Phone FROM schools AS T1 INNER JOIN ...,simple

In [5]:
train_df.db_id.shape

(9428,)

In [6]:
train_df.db_id.value_counts()

db_id
works_cycles              474
public_review_platform    381
retail_world              373
movie_3                   325
mondial_geo               293
                         ...
trains                     40
shooting                   28
genes                      23
citeseer                   19
craftbeer                   6
Name: count, Length: 69, dtype: int64

In [7]:
dev_df.db_id.value_counts()

db_id
card_games                 191
codebase_community         186
formula_1                  174
thrombosis_prediction      163
student_club               158
toxicology                 145
superhero                  129
european_football_2        129
financial                  106
california_schools          89
debit_card_specializing     64
Name: count, dtype: int64

In [11]:
# count rows where SQL column contains 'GROUP BY'
print('GROUP BY: ',train_df[train_df.SQL.str.contains('GROUP BY')].shape[0])
print('LIMIT: ',train_df[train_df.SQL.str.contains('LIMIT')].shape[0])
print('JOIN: ',train_df[train_df.SQL.str.contains('JOIN')].shape[0])
print('WHERE: ',train_df[train_df.SQL.str.contains('WHERE')].shape[0])

GROUP BY:  1009
LIMIT:  1804
JOIN:  7212
WHERE:  8275

In [12]:
# create flags
train_df['sql_group_by'] = train_df.SQL.str.contains('GROUP BY')
train_df['sql_limit'] = train_df.SQL.str.contains('LIMIT')
train_df['sql_join'] = train_df.SQL.str.contains('JOIN')
#create flag if evidence columns has any text
train_df['has_evidence'] = train_df.evidence.str.len() > 0

In [13]:
# create pivot table with rows as db_id and columns as sql_group_by, sql_limit, sql_join
train_df_pivot = train_df.pivot_table(index='db_id', values=['sql_group_by','sql_limit','sql_join','has_evidence'], aggfunc='sum')

# add a column with records count
train_df_pivot['records_count'] = train_df.groupby('db_id').size()
train_df_pivot

,has_evidence,sql_group_by,sql_join,sql_limit,records_count
db_id,,,,,
address,130,26,148,23,150
airline,88,23,66,21,92
app_store,63,11,40,12,63
authors,170,7,137,16,174
beer_factory,131,22,109,26,131
...,...,...,...,...,...
university,147,4,105,34,150
video_games,197,23,156,34,201
works_cycles,433,43,344,128,474
world,85,6,76,30,99
world_development_indicators,140,2,109,23,157

In [14]:
# selet records where db_id = airline
train_df[train_df.db_id == 'airline']

,db_id,question,evidence,SQL,sql_group_by,sql_limit,sql_join,has_evidence
5820,airline,How many flights were there on 2018/8/1?,on 2018/8/1 refers to FL_DATE = '2018/8/1';,SELECT COUNT(*) FROM Airlines WHERE FL_DATE = ...,False,False,False,True
5821,airline,"Among the flights on 2018/8/1, how many of the...",on 2018/8/1 refers to FL_DATE = '2018/8/1'; de...,SELECT COUNT(*) FROM Airlines WHERE FL_DATE = ...,False,False,False,True
5822,airline,Please list the destination cities of all the ...,destination cities refers to DEST; cancelled r...,SELECT DEST FROM Airlines WHERE FL_DATE = '201...,True,False,False,True
5823,airline,Please list the dates of the flights that were...,dates of the flights refers to FL_DATE; cancel...,SELECT FL_DATE FROM Airlines WHERE CANCELLATIO...,True,False,False,True
5824,airline,Please list the departure airports of the flig...,departure airports refers ORIGIN; on 2018/8/1 ...,SELECT T1.Description FROM Airports AS T1 INNE...,True,False,True,True
...,...,...,...,...,...,...,...,...
5907,airline,Provide the air carrier description of the fli...,tail number refers to TAIL_NUM; TAIL_NUM = 'N9...,SELECT T2.Description FROM Airlines AS T1 INNE...,True,False,True,True
5908,airline,Give the air carrier description of the flight...,earlier arrival and departure refers to ARR_DE...,SELECT T1.Description FROM `Air Carriers` AS T...,True,False,True,True
5909,airline,"Among the flights with air carrier ""Southwest ...",Southwest Airlines Co.: WN refers to Descripti...,SELECT T2.TAIL_NUM FROM `Air Carriers` AS T1 I...,False,False,True,True
5910,airline,List the air carrier's description with arriva...,arrival time lower than the 40% of the average...,SELECT T1.Description FROM `Air Carriers` AS T...,True,False,True,True
5911,airline,Among the flights of the air carrier described...,American Airlines can be found in Description ...,SELECT CAST(SUM(CASE WHEN T2.DEP_DELAY < 0 THE...,False,False,True,True